declare module 'hover-effect' {
  // Интерфейс для опций HoverEffect
  interface HoverEffectOptions {
    /**
     * DOM элемент, в который будет встроена анимация.
     * Изображения анимации займут размер родительского элемента.
     */
    parent: HTMLElement;

    /**
     * Первое изображение для анимации.
     */
    image1: string;

    /**
     * Второе изображение для анимации.
     */
    image2: string;

    /**
     * Изображение, используемое для перехода между двумя основными изображениями.
     */
    displacementImage: string;

    /**
     * Используется для определения интенсивности эффекта искажения.
     * 0 - без эффекта, 1 - максимальное искажение.
     * @default 1
     */
    intensity?: number;

    /**
     * Переопределяет интенсивность искажения для первого изображения.
     * @default intensity
     */
    intensity1?: number;

    /**
     * Переопределяет интенсивность искажения для второго изображения.
     * @default intensity
     */
    intensity2?: number;

    /**
     * Угол эффекта искажения в радианах.
     * @default Math.PI / 4 (45 градусов)
     */
    angle?: number;

    /**
     * Переопределяет угол искажения для первого изображения.
     * @default angle
     */
    angle1?: number;

    /**
     * Переопределяет угол искажения для второго изображения.
     * @default -angle * 3
     */
    angle2?: number;

    /**
     * Скорость входящей анимации (в секундах).
     * @default 1.6
     */
    speedIn?: number;

    /**
     * Скорость исходящей анимации (в секундах).
     * @default 1.2
     */
    speedOut?: number;

    /**
     * Если установлено в false, анимация не будет запускаться при наведении.
     * @default true
     */
    hover?: boolean;

    /**
     * Плавность перехода, см. easing в greensock.
     * @default Expo.easeOut
     */
    easing?: string;

    /**
     * Определяет, хотите ли вы использовать видео вместо изображений.
     * Примечание: вам нужно два видео, это не работает с одним изображением и одним видео.
     * @default false
     */
    video?: boolean;

    /**
     * Укажите значение, если хотите использовать поведение background: cover,
     * иначе будет применено квадратное соотношение сторон.
     * Пример использования: высота изображения / ширина изображения.
     * Пример: 1080 / 1920
     * @default 1
     */
    imagesRatio?: number;
  }

  // Основной экспорт модуля hover-effect
  export default class HoverEffect {
    constructor(options: HoverEffectOptions);
    /**
     * Переход к следующему изображению.
     */
    next(): void;
    /**
     * Переход к предыдущему изображению.
     */
    previous(): void;
  }
}
